<!-- dflook/terraform-github-actions {"workspace":"production","backend_type":"remote","label":"Production","backend":"0b18b7106e76498dc2b837c0e2ae977c48d9ad200cb7e44d18246ca53c9ab145","plan_job_ref":"Job Terraform Plan #26 at https://github.com/LancelotP/toolbox/actions/runs/15844071150","plan_hash":"cd06cf670f008c5fab7b6e570a8623687d595d61dde4c9a97c75d74361f178d6","plan_text_format":"diff","version":"2.1.0","plan_out_hash":"0bb7d618e3201d7ded16f60af81f484f0292e8fbe9afd848743735952f9e2de4","closed":true} -->
Terraform plan for __Production__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.cloudflare_env.cloudflare_dns_record.api will be created
+   resource "cloudflare_dns_record" "api" {
+       comment_modified_on = (known after apply)
+       content             = "toolboxproductionapirul2tipj-toolbox-production-api.functions.fnc.fr-par.scw.cloud"
+       created_on          = (known after apply)
+       id                  = (known after apply)
+       meta                = (known after apply)
+       modified_on         = (known after apply)
+       name                = "api.prigent.dev"
+       proxiable           = (known after apply)
+       proxied             = true
+       settings            = (known after apply)
+       tags                = (known after apply)
+       tags_modified_on    = (known after apply)
+       ttl                 = 1
+       type                = "CNAME"
+       zone_id             = (sensitive value)
    }

  # module.scaleway_env.scaleway_container_domain.api will be created
+   resource "scaleway_container_domain" "api" {
+       container_id = "*******************************************"
+       hostname     = "api.prigent.dev"
+       id           = (known after apply)
+       region       = (known after apply)
+       url          = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Terraform Apply #5](https://github.com/LancelotP/toolbox/actions/runs/15844095580)